FIOLOG/nvme0n1_220606_131446_fio.log
/dev/nvme0n1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1022737: Mon Jun  6 13:14:56 2022
  read: IOPS=41.3k, BW=162MiB/s (169MB/s)(1615MiB/10002msec)
    slat (nsec): min=1855, max=168976, avg=3425.11, stdev=2749.90
    clat (usec): min=748, max=2884, avg=1543.33, stdev=29.54
     lat (usec): min=753, max=2886, avg=1546.81, stdev=29.33
    clat percentiles (usec):
     |  1.00th=[ 1483],  5.00th=[ 1516], 10.00th=[ 1532], 20.00th=[ 1532],
     | 30.00th=[ 1549], 40.00th=[ 1549], 50.00th=[ 1549], 60.00th=[ 1549],
     | 70.00th=[ 1549], 80.00th=[ 1549], 90.00th=[ 1565], 95.00th=[ 1582],
     | 99.00th=[ 1598], 99.50th=[ 1614], 99.90th=[ 1663], 99.95th=[ 1778],
     | 99.99th=[ 2278]
   bw (  KiB/s): min=165024, max=165824, per=25.01%, avg=165462.74, stdev=187.47, samples=19
   iops        : min=41256, max=41456, avg=41365.68, stdev=46.87, samples=19
  lat (usec)   : 750=0.01%, 1000=0.02%
  lat (msec)   : 2=99.95%, 4=0.03%
  cpu          : usr=8.45%, sys=17.76%, ctx=178984, majf=0, minf=73
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=413554,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1022738: Mon Jun  6 13:14:56 2022
  read: IOPS=41.4k, BW=162MiB/s (169MB/s)(1616MiB/10002msec)
    slat (nsec): min=1852, max=82109, avg=3392.12, stdev=2703.74
    clat (usec): min=715, max=3230, avg=1543.10, stdev=28.72
     lat (usec): min=725, max=3234, avg=1546.56, stdev=28.55
    clat percentiles (usec):
     |  1.00th=[ 1500],  5.00th=[ 1516], 10.00th=[ 1532], 20.00th=[ 1532],
     | 30.00th=[ 1549], 40.00th=[ 1549], 50.00th=[ 1549], 60.00th=[ 1549],
     | 70.00th=[ 1549], 80.00th=[ 1549], 90.00th=[ 1565], 95.00th=[ 1565],
     | 99.00th=[ 1598], 99.50th=[ 1614], 99.90th=[ 1696], 99.95th=[ 2057],
     | 99.99th=[ 2540]
   bw (  KiB/s): min=164080, max=165848, per=25.01%, avg=165492.63, stdev=376.50, samples=19
   iops        : min=41020, max=41462, avg=41373.16, stdev=94.13, samples=19
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=99.94%, 4=0.06%
  cpu          : usr=9.63%, sys=16.39%, ctx=189605, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=413631,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1022739: Mon Jun  6 13:14:56 2022
  read: IOPS=41.3k, BW=162MiB/s (169MB/s)(1615MiB/10002msec)
    slat (nsec): min=1843, max=98386, avg=3383.23, stdev=2701.59
    clat (usec): min=1037, max=4896, avg=1543.40, stdev=39.90
     lat (usec): min=1041, max=4904, avg=1546.84, stdev=39.80
    clat percentiles (usec):
     |  1.00th=[ 1500],  5.00th=[ 1516], 10.00th=[ 1532], 20.00th=[ 1532],
     | 30.00th=[ 1549], 40.00th=[ 1549], 50.00th=[ 1549], 60.00th=[ 1549],
     | 70.00th=[ 1549], 80.00th=[ 1549], 90.00th=[ 1565], 95.00th=[ 1565],
     | 99.00th=[ 1598], 99.50th=[ 1614], 99.90th=[ 1647], 99.95th=[ 1778],
     | 99.99th=[ 3982]
   bw (  KiB/s): min=164128, max=165888, per=25.01%, avg=165461.47, stdev=372.26, samples=19
   iops        : min=41032, max=41472, avg=41365.37, stdev=93.06, samples=19
  lat (msec)   : 2=99.96%, 4=0.03%, 10=0.01%
  cpu          : usr=8.92%, sys=17.12%, ctx=188231, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=413547,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1022740: Mon Jun  6 13:14:56 2022
  read: IOPS=41.3k, BW=162MiB/s (169MB/s)(1616MiB/10002msec)
    slat (nsec): min=1860, max=82869, avg=3412.01, stdev=2689.29
    clat (usec): min=730, max=3402, avg=1543.29, stdev=34.50
     lat (usec): min=746, max=3405, avg=1546.76, stdev=34.35
    clat percentiles (usec):
     |  1.00th=[ 1500],  5.00th=[ 1516], 10.00th=[ 1532], 20.00th=[ 1532],
     | 30.00th=[ 1549], 40.00th=[ 1549], 50.00th=[ 1549], 60.00th=[ 1549],
     | 70.00th=[ 1549], 80.00th=[ 1549], 90.00th=[ 1565], 95.00th=[ 1565],
     | 99.00th=[ 1598], 99.50th=[ 1614], 99.90th=[ 1713], 99.95th=[ 2147],
     | 99.99th=[ 3032]
   bw (  KiB/s): min=164776, max=165808, per=25.01%, avg=165480.84, stdev=233.88, samples=19
   iops        : min=41194, max=41452, avg=41370.21, stdev=58.47, samples=19
  lat (usec)   : 750=0.01%, 1000=0.02%
  lat (msec)   : 2=99.91%, 4=0.06%
  cpu          : usr=9.06%, sys=16.85%, ctx=182675, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=413578,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=646MiB/s (677MB/s), 162MiB/s-162MiB/s (169MB/s-169MB/s), io=6462MiB (6776MB), run=10002-10002msec

Disk stats (read/write):
  nvme0n1: ios=1636887/0, merge=0/0, ticks=2516030/0, in_queue=2516030, util=99.05%